emacs/.emacs.d/Readme.org
** MacOS
Some custom preferences dedicated to MacOS
- keys for apple keyboard
- use the right ~⌥~ key to write symbols ={[]}=. The left ~⌥~ key can be used as the Meta
- GPG
- ...

 #+begin_src emacs-lisp
   (when is-mac
     ;; Keys for Appel keyboard
     (setq mac-command-modifier 'meta)    ; make cmd key do Meta
     (setq mac-option-modifier 'super)    ; make opt key do Super
     (setq mac-control-modifier 'control) ; make Control key do Control
     (setq ns-function-modifier 'hyper)   ; make Fn key do Hyper

     ;; Write Symbols [{}]
     (setq-default mac-right-option-modifier nil)

     ;; GPG
     (setf epa-pinentry-mode 'loopback)

     ;; Freench Locale
     (set-locale-environment "fr_FR.UTF-8"))
 #+end_src
** Uniquify

Uniquify file path to ensure buffer name uniqueness

#+begin_src emacs-lisp
  (use-package uniquify
    :straight nil
    :custom
    (uniquify-buffer-name-style 'forward)
    (uniquify-separator "/")
    (uniquify-after-kill-buffer-p t)
    (uniquify-ignore-buffers-re "^\\*")
  )
#+end_src
** Recent Files

 #+BEGIN_QUOTE
 Recentf is a minor mode that builds a list of recently opened
 files. This list is is automatically saved across sessions on exiting
 Emacs - you can then access this list through a command or the menu.

 [[https://www.emacswiki.org/emacs/RecentFiles][https://www.emacswiki.org/emacs/RecentFiles]]
 #+END_QUOTE

 #+begin_src emacs-lisp
   (use-package recentf
     :straight nil
     :custom
     (recentf-auto-cleanup "09:00am")
     (recentf-max-saved-items 300)
     (recentf-exclude '((expand-file-name package-user-dir)
                        ".cache"
                        ".cask"
                        ".elfeed"
                        "bookmarks"
                        "cache"
                        "ido.*"
                        "persp-confs"
                        "recentf"
                        "undo-tree-hist"
                        "url"
                        "COMMIT_EDITMSG\\'")))

   ;; When buffer is closed, saves the cursor location
   (save-place-mode 1)

   (recentf-mode 1)

   ;; Set history-length longer
   (setq-default history-length 500)

 #+end_src


** Hippie Expand
[[https://www.emacswiki.org/emacs/HippieExpand][Hippie Expand]] custom configuration 
Fix Conflict with company-complete
#+begin_src emacs-lisp
  (setq hippie-expand-try-functions-list '(try-expand-dabbrev
                                           try-expand-dabbrev-all-buffers
                                           try-expand-dabbrev-from-kill
                                           try-complete-file-name-partially
                                           try-complete-file-name
                                           try-expand-all-abbrevs
                                           try-expand-list
                                           try-expand-line
                                           try-complete-lisp-symbol-partially
                                           try-complete-lisp-symbol))
  
  (global-set-key (kbd "M-/") #'hippie-expand)
#+end_src
* UI
:properties:
:header-args+: :tangle "./lisp/setup-ui.el"
:end:

UI configuration module automatically tangled in =./lisp/setup-ui.el=

#+begin_src emacs-lisp :noweb yes
  ;;; setup-ui.el --- UI configuration module -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src
** Minimalistic UI
*** No menu and toolbar

#+begin_src emacs-lisp
(if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
(if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
(if (fboundp 'menu-bar-mode) (menu-bar-mode -1))
#+end_src

*** No welcome screen

#+begin_src emacs-lisp
(setq  inhibit-startup-message t)
#+end_src

*** Make fringe smaller

#+begin_src emacs-lisp
  (if (fboundp 'fringe-mode)
      (fringe-mode 2))
#+end_src
** All The Icons
#+begin_src emacs-lisp
(use-package all-the-icons)
#+end_src
** Theme
Using moe theme dark all the day
#+begin_src emacs-lisp
  (use-package doom-themes

    :config

    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled

    ;; Load the theme (doom-one, doom-molokai, etc); keep in mind that each theme
    ;; may have their own settings.
    (load-theme 'doom-one t)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)

    ;; or for treemacs users
    ;;(doom-themes-treemacs-config)

    ;; Corrects (and improves) org-mode's native fontification.
    (with-eval-after-load 'org-mode
        (doom-themes-org-config))
    )
#+end_src
** Mode line
#+begin_src emacs-lisp
  (use-package doom-modeline
    :hook (after-init . doom-modeline-init))
#+end_src

** Font
Use Input Font (http://input.fontbureau.com/)  on Linux, Monaco on MacOS

#+begin_src emacs-lisp
  (defun nc/setup-font ()
    "Set up font height"
    (interactive)
    (when is-linux
      (set-frame-font "Input Mono-12" nil t))
    (when is-mac
      (set-frame-font "Monaco 15" nil t))
    (when is-windows
      (set-frame-font "Consolas" nil t))
    )

  (when has-gui
    (add-hook 'after-init-hook #'nc/setup-font))
#+end_src

* Key Bindings
:properties:
:header-args+: :tangle "./lisp/setup-keys.el"
:end:
Key bindings configuration module automatically tangled in =./lisp/setup-keys.el=
#+begin_src emacs-lisp :noweb yes
  ;;; setup-keys.el --- Key Bindings module -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src


** Global Key Bindings
Emacs Global Bindings are redefined here.
#+begin_src emacs-lisp
  ;; Unbind unneeded keys
  (global-set-key (kbd "C-z") nil)
  (global-set-key (kbd "M-z") nil)
  (global-set-key (kbd "C-x C-z") nil)
  (global-set-key (kbd "M-o") nil)


  (global-set-key (kbd "C-+") #'text-scale-increase)
  (global-set-key (kbd "C--") #'text-scale-decrease)

  ;; Prefer backward-kill-word over Backspace
  (global-set-key (kbd "C-w") #'backward-kill-word)
  (global-set-key (kbd "C-x C-k") #'kill-region)

  (global-set-key (kbd "C-x C-r") #'recentf-open-files)

  ;; Move up/down paragraph
  (global-set-key (kbd "M-n") #'forward-paragraph)
  (global-set-key (kbd "M-p") #'backward-paragraph)

  ;; Goto Line
  ;;(global-set-key (kbd "M-g") #'goto-line)

  ;; Functions
  (global-set-key (kbd "<f5>") #'revert-buffer)

#+end_src
** Personal keyboard map

#+begin_src emacs-lisp
  (bind-keys
   :prefix-map nc-map
   :prefix-docstring "My own keyboard map"
   :prefix "C-<"
   ;; 2013-03-31: http://stackoverflow.com/questions/3124844/what-are-your-favorite-global-key-bindings-in-emacs
   (";" . nc/goto-emacs-config)
   ("<tab>" . expand-abbrev))
#+end_src
** Key Chords

#+begin_src emacs-lisp
  (use-package key-chord
    :init
    (key-chord-mode 1)
    (key-chord-define-global "FF" 'projectile-find-file)
    (key-chord-define-global "GG" 'consult-ripgrep)
    (key-chord-define-global "OO" 'consult-outline)
    (key-chord-define-global "DD" 'delete-region)
    (key-chord-define-global "??" 'nc/search-notes)
    (key-chord-define-global "BB" 'beginning-of-buffer)
    (key-chord-define-global "$$" 'end-of-buffer))

#+end_src

** Which Key

[[https://github.com/justbur/emacs-which-key][Which Key]] is a minor mode for Emacs that displays the key bindings following
your currently entered incomplete command (a prefix) in a popup.

#+begin_src emacs-lisp
(use-package which-key
  :diminish
  :custom
  (which-key-separator " ")
  (which-key-prefix-prefix "+")
  :config
  (which-key-mode))
#+end_src
* Windows
:properties:
:header-args+: :tangle "./lisp/setup-windows.el"
:end:

Windows configuration module automatically tangled in =./lisp/setup-windows.el=

#+begin_src emacs-lisp :noweb yes
  ;;; setup-windows.el --- Windows configuration file -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src


** Ace Window
[[https://github.com/abo-abo/ace-window][ace-window]] Quickly switch and move windows

#+begin_src emacs-lisp
  (use-package ace-window
    :bind (([remap other-window] . ace-window))
    :config
    (setq aw-keys '(?q ?s ?d ?f ?g ?h ?j ?k ?l))
    ;; increase size face
    (custom-set-faces
     '(aw-leading-char-face
       ((t (:inherit ace-jump-face-foreground :height 3.0))))))
 #+end_src

** Golden Ratio

 Resize automatically the windows you are working

 #+begin_src emacs-lisp
   (use-package golden-ratio
     :diminish t
     :init
     (golden-ratio-mode 1)
     :config
     (setq golden-ratio-extra-commands
           (append golden-ratio-extra-commands
                   '(ace-window))))
 #+end_src


** Toggle Window Split Horizontally

Bound to =C-z w -=.
#+begin_src emacs-lisp
  (defun nc/toggle-split-window-horizontally ()
    (interactive)
    (if (= (count-windows) 2)
        (let* ((this-win-buffer (window-buffer))
               (next-win-buffer (window-buffer (next-window)))
               (this-win-edges (window-edges (selected-window)))
               (next-win-edges (window-edges (next-window)))
               (this-win-2nd (not (and (<= (car this-win-edges)
                                           (car next-win-edges))
                                       (<= (cadr this-win-edges)
                                           (cadr next-win-edges)))))
               (splitter
                (if (= (car this-win-edges)
                       (car (window-edges (next-window))))
                    'split-window-horizontally
                  'split-window-vertically)))
          (delete-other-windows)
          (let ((first-win (selected-window)))
            (funcall splitter)
            (if this-win-2nd (other-window 1))
            (set-window-buffer (selected-window) this-win-buffer)
            (set-window-buffer (next-window) next-win-buffer)
            (select-window first-win)
            (if this-win-2nd (other-window 1))))))

  (bind-key "wh" 'nc/toggle-split-window-horizontally nc-map)
#+end_src


** Toggle Window Split Vertically 
Split window right with =C-< w v= and move there.
If windows are splitted delete other windows.
#+begin_src emacs-lisp
  (defun nc--split-window-right-and-move-there-dammit ()
    (split-window-right)
    (windmove-right))

  (defun nc/toggle-split-window-vertically ()
    (interactive)
    (if (> (count-windows) 1)
        (delete-other-windows)
      (nc--split-window-right-and-move-there-dammit)))

  (bind-key "wv" 'nc/toggle-split-window-vertically nc-map)
  (bind-key "C-w" 'nc/toggle-split-window-vertically nc-map)
  #+end_src


* Core Packages
:properties:
:header-args+: :tangle "./lisp/setup-core.el"
:end:

Core packages configuration module automatically tangled in =./lisp/setup-core.el=

#+begin_src emacs-lisp :noweb yes
  ;;; setup-core.el --- Core packages configuration file -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src

** Avy

#+begin_src emacs-lisp
  (use-package avy
    :defer t
    :bind
    (:map nc-map ((">" . avy-goto-char-timer)
                 ("l" . avy-goto-line)))
    :custom
    (avy-timeout-seconds 0.3)
    (avy-style 'pre)
    :custom-face
    (avy-lead-face ((t (:background "#51afef" :foreground "#870000" :weight bold)))))
#+end_src

** Crux
[[https://github.com/bbatsov/crux][Crux]] A Collection Of Ridiculosy Useful eXtensions for Emacs
#+begin_src emacs-lisp
  (use-package crux
    :bind
    (("C-a" . crux-move-beginning-of-line)
     ("C-c d" . crux-duplicate-current-line-or-region)
     ("C-x 4 t" . crux-transpose-windows)
     ("C-x K" . crux-kill-other-buffers)
     ("C-k" . crux-smart-kill-line)
     ("M-j" . crux-top-join-line))
    (:map nc-map ("C-j" . crux-top-join-line))
    :config
    (crux-with-region-or-buffer indent-region)
    (crux-with-region-or-buffer untabify)
    (crux-with-region-or-point-to-eol kill-ring-save)
    (defalias 'rename-file-and-buffer #'crux-rename-file-and-buffer))
#+end_src

** Dired
*** Dired
#+begin_src emacs-lisp
  (use-package dired
    :straight nil
    :bind
    (("C-x C-j" . dired-jump))
    :custom
    ;; Always delete and copy recursively
    (dired-recursive-deletes 'always)
    (dired-recursive-copies 'always)
    ;; Auto refresh Dired, but be quiet about it
    (global-auto-revert-non-file-buffers t)
    (auto-revert-verbose nil)
    ;; Quickly copy/move file in Dired
    (dired-dwim-target t)
    ;; Move files to trash when deleting
    (delete-by-moving-to-trash t)
    ;; Load the newest version of a file
    (load-prefer-newer t)
    ;; Detect external file changes and auto refresh file
    (auto-revert-use-notify nil)
    (auto-revert-interval 3) ; Auto revert every 3 sec


    :config
    ;; Enable global auto-revert
    (global-auto-revert-mode t)

    (put 'dired-find-alternate-file 'disabled nil)
    ;; Using GNU ls on macOS instead of ls
    (if (executable-find "gls")
        (progn
          (setq insert-directory-program "gls")
          (setq dired-listing-switches "-lFaGh1v --group-directories-first"))
      (setq dired-listing-switches "-ahlF"))

    :hook
    (dired-mode . (lambda ()
                    (local-set-key (kbd "<mouse-2>") #'dired-find-alternate-file)
                    (local-set-key (kbd "RET") #'dired-find-alternate-file)
                    (local-set-key (kbd "^")
                                   (lambda () (interactive) (find-alternate-file ".."))))))

#+end_src
*** Dired Narrow

[[https://github.com/Fuco1/dired-hacks/tree/7c0ef09d57a80068a11edc74c3568e5ead5cc15a#dired-narrow][Dired Narrow]] provides live filtering of files in dired buffers. In
general, after calling the respective narrowing function you type a
filter string into the minibuffer.

#+begin_src emacs-lisp
  (use-package dired-narrow
    :commands dired-narrow
    :after dired
    :bind (:map dired-mode-map
                ("/" . dired-narrow)))
#+end_src

