emacs/.emacs.d/Readme.org
*** Font Lock Dired

[[https://github.com/purcell/diredfl][Diredfl]] Extra font lock rules for a  more colorful dired.

#+begin_src emacs-lisp
  (use-package diredfl
    :init (diredfl-global-mode 1))
#+end_src


** Projectile

[[https://github.com/bbatsov/projectile][Projectile]] Project interaction library for emacs.

#+begin_src emacs-lisp
  (use-package projectile
    :custom
    (projectile-sort-order 'recently-active)
    :config
    (projectile-global-mode)
    :init
      (setq projectile-enable-caching t)
      ;; Custom mode line
      (setq projectile-mode-line '(:eval (format " Ⓟ[%s]" (projectile-project-name))))
    :bind-keymap ("C-c p" . projectile-command-map))
#+end_src

** Expand region
#+BEGIN_QUOTE
Expand region increases the selected region by semantic units. Just keep pressing the key until it selects what you want.

[[https://github.com/magnars/expand-region.el]]
#+END_QUOTE

- expand selection with =C-==
- contract with negative argument =M--= then =C-==

 #+begin_src emacs-lisp
 (use-package expand-region
   :bind
   ("C-=" . er/expand-region))
 #+end_src

** Multiple Cursors

 [[https://github.com/magnars/multiple-cursors.el][multiple-cursors.el]] This package can create several cursors to all do the same things.

 #+begin_src emacs-lisp
   (use-package multiple-cursors
     :bind
     (("C-S-c C-S-c" .  mc/edit-lines)
      ("C-$" .  mc/edit-ends-of-lines)
      ("C-S-b" .  mc/edit-beginnings-of-lines)
      ;; Conflict my own map
      ;("C-<" .  mc/mark-previous-word-like-this) 
      ;("C->" .  mc/mark-next-word-like-this)
      ("C-S-n" .  mc/mark-next-like-this)
      ("C-S-p" .  mc/mark-previous-like-this)
      ("C-*" .  mc/mark-all-dwim)))
 #+end_src

** Undo Tree
 This lets you use =C-x u= (=undo-tree-visualize=)
 #+begin_src emacs-lisp
   (use-package undo-tree
     :diminish undo-tree-mode
     :config
     (progn
       (global-undo-tree-mode)
       (setq undo-tree-visualizer-timestamps t)
       (setq undo-tree-visualizer-diff t)))
 #+end_src

** Ediff

 From : [[https://www.emacswiki.org/emacs/EdiffMode]]

 You can ignore whitespace or case sensitivity in two ways:
- Interactively, on the fly:
   - Whitespace sensitivity – Toggle with =##= (=ediff-toggle-skip-similar=).
   - Case sensitivity – Toggle with =#c= (=ediff-toggle-ignore-case=). This assumes that you’ve loaded library Lisp:ediff+.el and that you are using `diff(1)’ as ‘ediff-diff-program’. (Toggling case-sensitivity is available in vanilla GNU Emacs 22, so Lisp:ediff+.el is mainly useful for older Emacs versions.)
 - Persistently: Customize option =ediff-diff-options=. This assumes that you are using `diff(1)’ as ‘ediff-diff-program’.
    - Whitespace insensitivity – Include ‘-w’ in =ediff-diff-options=.
    - Case insensitivity – Include ‘-i’ in =ediff-diff-options=.

#+begin_src emacs-lisp
  (use-package ediff
    :straight nil
    :custom
     ;; Ediff should be opened in selected frame and split window horizontally
    (ediff-window-setup-function 'ediff-setup-windows-plain)
    (ediff-split-window-function 'split-window-horizontally)
    (ediff-diff-options "-w")
    :config
    ;; Pour éviter des ouvertures de frames intempestives
    (advice-add 'ediff-window-display-p :override 'ignore))
#+end_src


** Magit

#+BEGIN_QUOTE
Magit a git porcelain inside Emacs !

[[https://github.com/magit/magit]]
#+END_QUOTE

#+begin_src emacs-lisp
  (use-package magit

    :init
    (when (getenv "GIT_EXECUTABLE")
      (setq magit-git-executable (getenv "GIT_EXECUTABLE")))

    :bind (("C-x g" . magit-status)
           ("<f6>" . magit-status )
           ("C-<f6>" . magit-log-buffer-file)))
#+end_src


** Treemacs

#+begin_quote
Treemacs - A tree layout file explorer for Emacs

https://github.com/Alexander-Miller/treemacs
#+end_quote

#+begin_src emacs-lisp
  (use-package treemacs
    :ensure t
    :defer t
    :init
    (with-eval-after-load 'winum
      (define-key winum-keymap (kbd "M-o") #'treemacs-select-window))
    :config
    (progn
      (setq treemacs-collapse-dirs                   (if treemacs-python-executable 3 0)
            treemacs-deferred-git-apply-delay        0.5
            treemacs-directory-name-transformer      #'identity
            treemacs-display-in-side-window          t
            treemacs-eldoc-display                   t
            treemacs-file-event-delay                5000
            treemacs-file-extension-regex            treemacs-last-period-regex-value
            treemacs-file-follow-delay               0.2
            treemacs-file-name-transformer           #'identity
            treemacs-follow-after-init               t
            treemacs-expand-after-init               t
            treemacs-git-command-pipe                ""
            treemacs-goto-tag-strategy               'refetch-index
            treemacs-indentation                     2
            treemacs-indentation-string              " "
            treemacs-is-never-other-window           nil
            treemacs-max-git-entries                 5000
            treemacs-missing-project-action          'ask
            treemacs-move-forward-on-expand          nil
            treemacs-no-png-images                   nil
            treemacs-no-delete-other-windows         t
            treemacs-project-follow-cleanup          nil
            treemacs-persist-file                    (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
            treemacs-position                        'left
            treemacs-read-string-input               'from-child-frame
            treemacs-recenter-distance               0.1
            treemacs-recenter-after-file-follow      nil
            treemacs-recenter-after-tag-follow       nil
            treemacs-recenter-after-project-jump     'always
            treemacs-recenter-after-project-expand   'on-distance
            treemacs-litter-directories              '("/node_modules" "/.venv" "/.cask")
            treemacs-show-cursor                     nil
            treemacs-show-hidden-files               t
            treemacs-silent-filewatch                nil
            treemacs-silent-refresh                  nil
            treemacs-sorting                         'alphabetic-asc
            treemacs-select-when-already-in-treemacs 'move-back
            treemacs-space-between-root-nodes        t
            treemacs-tag-follow-cleanup              t
            treemacs-tag-follow-delay                1.5
            treemacs-text-scale                      nil
            treemacs-user-mode-line-format           nil
            treemacs-user-header-line-format         nil
            treemacs-wide-toggle-width               70
            treemacs-width                           35
            treemacs-width-increment                 1
            treemacs-width-is-initially-locked       t
            treemacs-workspace-switch-cleanup        nil)

      ;; The default width and height of the icons is 22 pixels. If you are
      ;; using a Hi-DPI display, uncomment this to double the icon size.
      ;;(treemacs-resize-icons 44)

      (treemacs-follow-mode t)
      (treemacs-filewatch-mode t)
      (treemacs-fringe-indicator-mode 'always)

      (pcase (cons (not (null (executable-find "git")))
                   (not (null treemacs-python-executable)))
        (`(t . t)
         (treemacs-git-mode 'deferred))
        (`(t . _)
         (treemacs-git-mode 'simple)))

      (treemacs-hide-gitignored-files-mode nil))
    :bind
    (:map nc-map ("t" . treemacs))
    (:map global-map
          ("M-o"       . treemacs-select-window)
          ("C-x t 1"   . treemacs-delete-other-windows)
          ("C-x t t"   . treemacs)
          ("C-x t B"   . treemacs-bookmark)
          ("C-x t C-t" . treemacs-find-file)
          ("C-x t M-t" . treemacs-find-tag)))

  (use-package treemacs-projectile
    :after (treemacs projectile)
    :ensure t)

  (use-package treemacs-icons-dired
    :hook (dired-mode . treemacs-icons-dired-enable-once)
    :ensure t)
#+end_src

** Rainbow mode

#+begin_src emacs-lisp
(use-package rainbow-mode
  :ensure t
  :config
  (add-hook 'prog-mode-hook #'rainbow-mode)
  (diminish 'rainbow-mode))
#+end_src

** Yasnippet
Snippets for programming.

 #+begin_src emacs-lisp
   (use-package yasnippet
     :ensure t
     :diminish yas-minor-mode
     :config
     (use-package yasnippet-snippets)
     :hook
     (after-init . yas-global-mode))
 #+end_src

Consult integration
#+begin_src emacs-lisp
  (use-package consult-yasnippet
    :bind
    (:map nc-map 
          ("y" . consult-yasnippet)))
#+end_src

* Completion
:properties:
:header-args+: :tangle "./lisp/setup-completion.el"
:end:

Completion configuration automatically tangled in =./lisp/setup-completion.el=
#+begin_src emacs-lisp :noweb yes
  ;;; setup-completion.el --- Completion configuration file -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src

** Selectrum

#+begin_src emacs-lisp

  (use-package selectrum
    :init (selectrum-mode +1))
  (use-package prescient
    :config (prescient-persist-mode +1))
  (use-package selectrum-prescient
    :init (selectrum-prescient-mode +1) :after selectrum)

#+end_src
** Marginalia

#+begin_src emacs-lisp
  (use-package marginalia
    :ensure t
    :bind (:map minibuffer-local-map
                ("C-M-a" . marginalia-cycle))
    :init
    (marginalia-mode)
    (advice-add #'marginalia-cycle :after
                (lambda () (when (bound-and-true-p selectrum-mode) (selectrum-exhibit))))
    (setq marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil)))
#+end_src



