emacs/.emacs.d/lisp/setup-completion.el

(use-package selectrum
  :init (selectrum-mode +1))
(use-package prescient
  :config (prescient-persist-mode +1))
(use-package selectrum-prescient
  :init (selectrum-prescient-mode +1) :after selectrum)

(use-package marginalia
  :ensure t
  :bind (:map minibuffer-local-map
              ("C-M-a" . marginalia-cycle))
  :init
  (marginalia-mode)
  (advice-add #'marginalia-cycle :after
              (lambda () (when (bound-and-true-p selectrum-mode) (selectrum-exhibit))))
  (setq marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil)))
