emacs/.emacs.d/Readme.org
** Company

   #+begin_src emacs-lisp
     (use-package company
       :diminish ""
       :bind (("M-/" . company-complete)
              :map company-active-map
              ("C-p" . company-select-previous)
              ("C-n" . company-select-next)
              ("TAB" . company-complete-common-or-cycle)
              ("<tab>" . company-complete-common-or-cycle)
              ("C-d" . company-show-doc-buffer))
       :hook (after-init . global-company-mode)

       :custom
       (company-idle-delay 0.1)
       (company-require-match 'never)
       (company-minimum-prefix-length 2)
       (company-tooltip-align-annotations t)
       (company-frontends '(company-pseudo-tooltip-unless-just-one-frontend
                            company-preview-frontend
                            company-echo-metadata-frontend))
       (company-backends '(company-capf company-files company-dabbrev-code company-semantic))
       (company-tooltip-minimum-width 30)
       (company-tooltip-maximum-width 120))


  #+end_src

[[https://github.com/company-mode/company-statistics/][company-statistics]] extension to show the top ranked candidates

  #+begin_src emacs-lisp
    (use-package company-statistics
      :after company
      :config
      (company-statistics-mode 1))
   #+end_src

* Org
:properties:
:header-args+: :tangle "./lisp/setup-org.el"
:end:

Org mode configuration automatically tangled in =./lisp/setup-org.el=
#+begin_src emacs-lisp :noweb yes
  ;;; setup-org.el --- Org mode configuration file -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src


** Org Base Configuration

#+begin_src emacs-lisp
  (use-package org

    :bind (("C-c l" . org-store-link)
           ("C-c c" . org-capture)
           ("C-c a" . org-agenda)
           ("<f12>" . org-agenda)
           ("C-c C-b" . org-iswitchb))

    :config
    ;; New template exapnsion
    (require 'org-tempo)

    (setq org-ellipsis " ⬎"
          org-cycle-separator-lines 0                 ;; Hide empty lines between subtrees
          org-catch-invisible-edits 'show-and-error   ;; Avoid inadvertent text edit in invisible area
          )

    (set-face-attribute 'org-ellipsis nil :underline nil)

    ;; Autamatically add =ID= (unique identifier) in heading drawers to keep links unique
    (require 'org-id)
    (setq org-id-method 'uuidgen)
    (setq org-id-link-to-org-use-id 'create-if-interactive-and-no-custom-id)

    (require 'org-crypt)
    (org-crypt-use-before-save-magic)

    (add-to-list 'org-tags-exclude-from-inheritance "crypt")
    ;; GPG key to use for encryption
    ;; Either the Key ID or set to nil to use symmetric encryption.
    (setq org-crypt-key "0DF2D6C6E8443FE7"))

    (use-package org-contrib)
#+end_src

** Org UI
*** Org Bullets

#+begin_src emacs-lisp
(use-package org-bullets
  :hook (org-mode . org-bullets-mode)
  :after org
  :custom (org-bullets-bullet-list '("◉" "✿" "★" "•")))

;; Hiding leading bullets in headers
(setq org-hide-leading-stars t)
#+end_src

*** Org Heading Styles

#+begin_src emacs-lisp
  (let* ((variable-tuple (cond ((x-list-fonts "Input Sans") '(:font "Input Sans"))
                               ((x-list-fonts "Lucida Grande")   '(:font "Lucida Grande"))
                               ((x-list-fonts "Verdana")         '(:font "Verdana"))
                               ((x-family-fonts "Sans Serif")    '(:family "Sans Serif"))
                               (nil (warn "Cannot find a Sans Serif Font.  Install Open Sans."))))
         (base-font-color     (face-foreground 'default nil 'default))
         (headline           `(:inherit default :weight normal :foreground ,base-font-color)))

    (custom-theme-set-faces 'user
                            '(org-special-keyword  ((t (:inherit (font-lock-comment-face fixed-pitch)) :foreground "#69ffeb")))

                            `(org-level-8 ((t (,@headline ,@variable-tuple))))
                            `(org-level-7 ((t (,@headline ,@variable-tuple))))
                            `(org-level-6 ((t (,@headline ,@variable-tuple))))
                            `(org-level-5 ((t (,@headline ,@variable-tuple))))
                            `(org-level-4 ((t (,@headline ,@variable-tuple :height 1.1))))
                            `(org-level-3 ((t (,@headline ,@variable-tuple :height 1.2 :foreground "#ff8a69"))))
                            `(org-level-2 ((t (,@headline ,@variable-tuple :height 1.3 :foreground "#ffd569"))))
                            `(org-level-1 ((t (,@headline ,@variable-tuple :height 1.5 :foreground "#ffaf69"))))
                            `(org-document-title ((t (,@headline ,@variable-tuple :height 1.8 :underline nil :foreground "#e6b68d"))))
                            `(org-document-info         ((t (:foreground "#697dff"))))
                            `(org-document-info-keyword         ((t (:foreground "#697dff"))))
                            `(header-line ((t (:background "#697dff" :height 220))))
                            '(org-special-keyword-face ((t (:foreground "#697dff"))))

                            '(org-block-begin-line ((t (:foreground "#69ffeb"))))
                            '(org-verbatim ((t (:foreground "#69ffeb"))))
                            '(org-table ((t (:foreground "#fae196"))))
                            `(org-checkbox ((t (:foreground "#ff4c4f"
                                           :box (:line-width 1 :style released-button)))))
                            `(org-date ((t (:foreground "#69ffeb"))))
                            `(org-tag ((t (:foreground "#e6b68d"))))

                            `(org-checkbox-statistics-todo ((t (:foreground "#ff4c4f"))))
                            '(org-list-dt               ((t (:foreground "#ff4c4f"))))
                            '(org-link                  ((t (:foreground "#697dff" :underline t))))))
#+end_src


*** org-fancy-priorities

#+begin_src emacs-lisp
(use-package org-fancy-priorities
      :diminish
      :defines org-fancy-priorities-list
      :hook (org-mode . org-fancy-priorities-mode)
      :config (setq org-fancy-priorities-list '("⚡" "⬆" "⬆" "⬇")))

#+end_src

Change priorities colors

#+begin_src emacs-lisp
(setq org-lowest-priority ?D
        org-default-priority ?D
        org-priority-faces '((?A . (:foreground "red" :weight bold))
                             (?B . (:foreground "orange"))
                             (?C . (:foreground "yellow"))
                             (?D . (:foreground "green"))))
#+end_src


*** Startup Indented
#+begin_src emacs-lisp
  (setq org-startup-indented t
        org-pretty-entities t
        ;; show actually italicized text instead of /italicized text/
        org-hide-emphasis-markers t
        org-fontify-quote-and-verse-blocks t)
#+end_src


** My Org Files

 My default org files

 #+begin_src emacs-lisp
   (use-package org
     :custom
     (org-directory "~/notes")
     :config
     
     (defconst nc/org-default-projects-dir (concat org-directory "/projects"))
     (defconst nc/org-default-projects-file (concat org-directory "/projects.org"))
     (defconst nc/org-default-resources-dir (concat org-directory "/resources"))
     (defconst nc/org-default-archives-dir (concat org-directory "/archives"))
     (defconst nc/org-default-personal-dir (concat org-directory "/personal"))
     (defconst nc/org-default-completed-dir (concat org-directory "/projects/_completed"))
     (defconst nc/org-journal-dir (concat org-directory "/journal"))
     (defconst nc/inbox-file (concat org-directory "/gtd.org"))
     (defconst nc/org-default-inbox-file (concat org-directory "/gtd.org"))
     (defconst nc/org-default-tasks-file (concat org-directory "/gtd.org"))
     (defconst nc/watching-file (concat org-directory "/personal/watching.org"))
     (defconst nc/reading-file (concat org-directory "/personal/books.org"))
     (defconst nc/org-default-media-files (concat org-directory "/personal/watching.org"))
     (defconst nc/org-default-someday-file (concat org-directory "/someday.org"))
     (defconst nc/fishing-file (concat org-directory "/personal/sports/fishing.org"))
     (defconst nc/calendar-file (concat org-directory "/personal/calendar.org"))
     (defconst nc/weekly-review-file (concat org-directory "/personal/reviews/weekly-review.org"))


     (defun nc/goto-inbox ()
       (interactive)
       (find-file nc/inbox-file )
       (widen)
       (beginning-of-buffer)
       (re-search-forward "* Inbox")
       (beginning-of-line))

     (bind-key "gi" 'nc/goto-inbox nc-map)


     (defun nc/goto-resources-dir ()
       (interactive)
       (dired nc/org-default-resources-dir))

     (bind-key "gR" 'nc/goto-resources-dir nc-map)

     (defun nc/goto-archives-dir ()
       (interactive)
       (dired nc/org-default-archives-dir))

     (bind-key "gA" 'nc/goto-archives-dir nc-map)

   )
 #+end_src


** Journal
 Function to easily load weekly journal
 #+begin_src emacs-lisp

   (defun nc/goto-journal-file ()
         "Create and load a journal file based on today's date."
         (interactive)

         (find-file (nc--get-journal-file-today)))

   (defun nc--get-journal-file-today ()
         "Return today's journal file."
         (let ((daily-name (format-time-string "%Y-W%W")))
           (expand-file-name (concat nc/org-journal-dir "/" daily-name ".org"))))

   (setq org-default-notes-file (nc--get-journal-file-today))

   (bind-key "gj" 'nc/goto-journal-file nc-map)
   (bind-key "j" 'nc/goto-journal-file nc-map)
 #+end_src


Insert daily heading in journal file =C-<-o-d=

   #+begin_src emacs-lisp
     (defun nc--autoinsert-yas-expand ()
           "Replace text in yasnippet template."
           (yas-expand-snippet (buffer-string) (point-min) (point-max)))

         (setq auto-insert 'other
               auto-insert-directory (concat org-directory "/templates"))

         (define-auto-insert "\\.org\\'" ["week.org" nc--autoinsert-yas-expand])


       (defun nc/journal-file-insert ()
         "Insert's the journal heading based on the file's name."
         (interactive)
         (let* ((datim (current-time)))

           (insert (format-time-string (concat "%A %d %B %Y") datim))


           ;; Note: The `insert-file-contents' leaves the cursor at the
           ;; beginning, so the easiest approach is to insert these files
           ;; in reverse order:

           ;; If the journal entry I'm creating matches today's date:

             ;; Insert dailies that only happen once a week:
             (let ((weekday-template (downcase
                                      (format-time-string "templates/journal-%A.org"))))
               (when (file-exists-p weekday-template)
                 (insert-file-contents weekday-template)))

             (insert "\n")

             ;; (let ((contents (buffer-string)))
             ;;   (delete-region (point-min) (point-max))
             ;;   (yas-expand-snippet contents (point-min) (point-max)))

             ))

     (defun nc/insert-daily-heading ()
       "Insert Daily Heading in journal file"
       (interactive)
       (let ( (header-title (format-time-string "%Y-W%W" )))
         ;; Don't change location of point.
         (goto-char (point-min)) ;; From the beginning...
         (if (search-forward header-title)
             ;;(end-of-line)
             (progn
               (org-insert-heading-after-current)
               (nc/journal-file-insert)
               (org-shiftmetaright))
           (error "Insert failed"))))

     ;; bind-key
      (bind-key "od" 'nc/insert-daily-heading nc-map)
   #+end_src

** Tasks
My Todos tasks
  - parentheses indicate keyboard shortcuts
  - =@= prompts for a note
  - =!= logs the timestamp of the state change

 #+begin_src emacs-lisp
   (setq org-todo-keywords
    '((sequence "TODO(t)" "NEXT(n)" "SOMEDAY(.)" "MAYBE(M)"  "|" "DONE(d)")
      (sequence "STARTED(s)" "WAITING(w@/!)" "|" "CANCELLED(c@/!)" "INACTIVE(i@)")
      (sequence "MEETING(m)" "RDV(r)"  "|" "DONE(d)")))
 #+end_src

Keep track when the task is completed.
 #+begin_src emacs-lisp
 (setq org-log-done 'time)
 #+end_src

 Tasks faces : colors from https://flatuicolors.com/

 #+begin_src emacs-lisp
   (setq org-todo-keyword-faces
         (quote (("TODO" :foreground "#c0392b" :weight bold)
                 ("NEXT" :foreground "#d35400" :weight bold)
                 ("STARTED" :foreground "#f39c12" :weight bold)
                 ("SOMEDAY" :foreground "#3498db" :weight bold)
                 ("DONE" :foreground "#27ae60" :weight bold)
                 ("WAITING" :foreground "#e74c3c" :weight bold)
                 ("INACTIVE" :foreground "#bdc3c7" :weight bold)
                 ("MEETING" :foreground "#e6b68d" :weight bold)
                 ("RDV" :foreground "#e6b68d" :weight bold)
                 ("MAYBE" :foreground "#3498db" :weight bold)
                 ("CANCELLED" :foreground "#7f8c8d" :weight bold))))
 #+end_src

** Tags (contexts)
In GTD tags are contexts
 #+begin_src emacs-lisp
   (setq org-tag-alist (quote ((:startgroup)
                               ("@office" . ?o)
                               ("@home" . ?h)
                               (:endgroup)
                               ("@computer" . ?c)
                               ("@reading" . ?r)
                               ("learning" . ?l)
                               ("emacs" . ?e)
                               (:newline)
                               ("WAITING" . ?w)
                               ("HOLD" . ?H)
                               ("CANCELLED" . ?c))))

   ;;(setq org-fast-tag-selection-single-key nil)
 #+end_src

Projects are marked with the =project= tag. They are supposed to
contain todo items, and are considered stuck unless they do. The
=project= tag should not be inheritable, because otherwise its tasks
will appear as projects.
 #+begin_src emacs-lisp
     (setq org-tags-exclude-from-inheritance '("project")
           org-stuck-projects '("+project/-DONE"
                                ("TODO" "NEXT") ()))
 #+end_src

