emacs/.emacs.d/lisp/setup-completion.el

(use-package company
  :diminish ""
  :bind (("M-/" . company-complete)
         :map company-active-map
         ("C-p" . company-select-previous)
         ("C-n" . company-select-next)
         ("TAB" . company-complete-common-or-cycle)
         ("<tab>" . company-complete-common-or-cycle)
         ("C-d" . company-show-doc-buffer))
  :hook (after-init . global-company-mode)

  :custom
  (company-idle-delay 0.1)
  (company-require-match 'never)
  (company-minimum-prefix-length 2)
  (company-tooltip-align-annotations t)
  (company-frontends '(company-pseudo-tooltip-unless-just-one-frontend
                       company-preview-frontend
                       company-echo-metadata-frontend))
  (company-backends '(company-capf company-files company-dabbrev-code company-semantic))
  (company-tooltip-minimum-width 30)
  (company-tooltip-maximum-width 120))

(use-package company-statistics
  :after company
  :config
  (company-statistics-mode 1))

(provide 'setup-completion)
