emacs/.emacs.d/Readme.org
** Org Roam

#+begin_src emacs-lisp

  ;; (when is-windows  
  ;;   (add-to-list 'exec-path "C:/ProgramJava/tools/sqlite-tools-win32-x86-3340100"))

  (use-package org-roam
    :after org
    :custom
    (org-roam-directory (concat org-directory "/slipbox"))
    :init
    (setq org-roam-v2-ack t)
    :bind
    ("C-c n l" . org-roam-buffer-toggle)
    ("C-c n f" . org-roam-node-find)
    ("C-c n r" . org-roam-node-random)
    (:map org-mode-map
          (("C-c n i" . org-roam-node-insert)))
    :config

    (setq org-roam-capture-templates '(("d" "default" plain "%?"
                                        :if-new
                                        (file+head "%<%Y-%m-%d--%H-%M>--${slug}.org"
                                                   "#+title: ${title}\n#+date: %u\n\n")
                                        :unnarrowed t
                                        :immediate-finish t))
          )
    ;; this sets up various file handling hooks so your DB remains up to date
    (org-roam-setup))

#+end_src
* Programming
:properties:
:header-args+: :tangle "./lisp/setup-programming.el"
:end:

Programming configuration module automatically tangled in =./lisp/setup-programming.el=
#+begin_src emacs-lisp :noweb yes
  ;;; setup-programming.el --- Programming configuration module -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src

** LSP Mode

#+begin_src emacs-lisp
  (use-package lsp-mode
    :commands lsp
    :bind-keymap ("C-< l" . lsp-command-map)
    :hook (lsp-mode . (lambda ()
                        (let ((lsp-keymap-prefix "C-< l"))
                          (lsp-enable-which-key-integration))))
    :config
    (setq ; recommended
          gc-cons-threshold (* 100 1024 1024)
          read-process-output-max (* 1024 1024))

    (setq ; optional
          ;; lsp-clojure-custom-server-command '("/Users/nchapon/_PIM/tmp/2del/clojure-lsp") 

          ; Features
          lsp-lens-enable t
          lsp-semantic-tokens-enable t

          ;; Conflicts with other Clojure emacs packages
          cljr-add-ns-to-blank-clj-files nil ; disable clj-refactor adding ns to blank files
          cider-eldoc-display-for-symbol-at-point nil ; disable cider eldoc integration
          ; lsp-eldoc-enable-hover nil ; disable lsp-mode showing eldoc during symbol at point
          ; lsp-enable-indentation nil ; uncomment to use cider indentation instead of lsp
          ; lsp-enable-completion-at-point nil ; uncomment to use cider completion instead of lsp
          ))

  ;; optionally
  (use-package lsp-ui
    :commands lsp-ui-mode
    :config
    (setq lsp-ui-doc-position 'top
          lsp-ui-doc-alignment 'window))

  (use-package lsp-treemacs :commands lsp-treemacs-errors-list)
#+end_src

This function adds the hooks that will enable LSP-powered formatting
and import organizing when saving a file with code.

#+begin_src elisp
  (defun lsp-save-hooks () "Install save hooks for lsp."
         (add-hook 'before-save-hook #'lsp-format-buffer t t)
         (add-hook 'before-save-hook #'lsp-organize-imports t t))
#+end_src

** Parenthesis
*** Smart Parens
Smart parens for all programming modes with paredit bindings.

#+begin_src emacs-lisp
  (use-package smartparens
    :defer t
    :diminish ""
    :hook (((clojure-mode
             emacs-lisp-mode
             common-lisp-mode
             scheme-mode
             lisp-mode
             cider-repl-mode
             inferior-lisp-mode
             inferior-emacs-lisp-mode)
            . smartparens-strict-mode)
           (prog-mode . smartparens-mode))

    :bind (:map smartparens-mode-map
                ("C-M-q" . sp-indent-defun)
                :map smartparens-strict-mode-map
                (";" . sp-comment))

    :config
    (require 'smartparens-config)
    (sp-use-paredit-bindings)
    (define-key smartparens-mode-map (kbd "M-r") 'sp-rewrap-sexp) ; needs to be set manually, because :bind section runs before config
    (setq smartparens-strict-mode t)
    (sp-local-pair 'emacs-lisp-mode "`" nil :when '(sp-in-string-p))

    (defun nc--create-newline-and-enter-sexp (&rest _ignored)
      "Open a new brace or bracket expression, with relevant newlines and indent. "
      (newline)
      (indent-according-to-mode)
      (forward-line -1)
      (indent-according-to-mode))

    (sp-with-modes '(c-mode c++-mode js-mode js2-mode java-mode
                            typescript-mode perl-mode)
      (sp-local-pair "{" nil :post-handlers
                     '((nc--create-newline-and-enter-sexp "RET")))))

#+end_src

*** Show Paren Mode
Emacs builtin show paren mode.
#+begin_src emacs-lisp
  (use-package paren
    :straight nil
    :hook (prog-mode . show-paren-mode)
    :custom
    (show-paren-delay 0)
    (show-paren-when-point-in-periphery t))
#+end_src



** Clojure
*** clojure-mode
#+begin_src emacs-lisp
  (use-package clojure-mode
    :hook
    ((clojure-mode . lsp)
     (clojurec-mode . lsp)
     (clojurescript-mode . lsp)
     (clojure-mode . lsp-save-hooks))
    :init
    (setq clojure-align-forms-automatically t))
#+end_src
*** Cider
#+begin_src emacs-lisp
  (use-package cider
    :init
    (setq org-babel-clojure-backend 'cider))
#+end_src

** Docker
#+begin_src emacs-lisp
(use-package dockerfile-mode
  :mode "Dockerfile.*\\'")
#+end_src
** Lua
#+begin_src emacs-lisp
(use-package lua-mode
  :mode "\\.lua\\'")
#+end_src
** Markdown

GitHub Flavored Markdown by default for README.md files.

#+begin_src emacs-lisp
  (use-package markdown-mode
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'"       . markdown-mode)
           ("\\.markdown\\'" . markdown-mode))
    :config

    (setq markdown-fontify-code-blocks-natively t)
  
    ;; Process Markdown with Pandoc, using GitHub stylesheet for nice output
    (let ((stylesheet (expand-file-name
                       (locate-user-emacs-file "etc/pandoc.css"))))
      (setq markdown-command
            (mapconcat #'shell-quote-argument
                       `("pandoc" "--toc" "--section-divs"
                         "--css" ,(concat "file://" stylesheet)
                         "--standalone" "-f" "markdown" "-t" "html5")
                       " "))))


  (use-package markdown-toc
    :after markdown-mode)

#+end_src
** Python
#+begin_src emacs-lisp
(use-package python-mode
  :straight nil
  :mode ("\\.py\\'")
  :custom
  (python-shell-interpreter "python3"))

#+end_src
** Web
*** Rest Client
[[https://github.com/pashky/restclient.el][Restclient]] Emacs client for testing API

#+begin_src emacs-lisp
(use-package restclient
  :mode (("\\.restclient\\'" . restclient-mode)
         ("\\.http\\'" . restclient-mode)))
#+end_src
*** Web Mode
[[https://web-mode.org/][Web Mode]] major mode for editing HTML pages

#+begin_src emacs-lisp
(use-package web-mode
  :mode (("\\.html\\'" . web-mode)
         ("\\.hbs\\'" . web-mode)
         ("\\.tag$" . web-mode)
         ("\\.ftl$" . web-mode)
         ("\\.jsp$" . web-mode)
         ("\\.php$" . web-mode))
  :config
  (add-hook 'web-mode-hook (lambda ()
                             (setq web-mode-markup-indent-offset 4)
                             (setq web-mode-code-indent-offset 4))))

#+end_src

*** Javascript
[[https://github.com/mooz/js2-mode][JS2 mode]] improved javascript editing mode
#+begin_src emacs-lisp
(use-package js2-mode
  :mode "\\.js\\'"
  :init
  (defalias 'javascript-generic-mode 'js2-mode)
  :config
  (js2-imenu-extras-setup)
  (setq-default js-auto-indent-flag nil
                js2-strict-missing-semi-warning nil
                js-indent-level 2)

  ;; Don't override global M-j keybinding (join lines)
  (define-key js2-mode-map (kbd "M-j") nil))

#+end_src


** YAML

#+begin_src emacs-lisp
  (use-package yaml-mode
    :mode (("\\.yaml\\'" . yaml-mode)
             ("\\.yml\\'" . yaml-mode))
    :custom
    (yaml-indent-offset 4))
#+end_src


* Shell
:properties:
:header-args+: :tangle "./lisp/setup-shell.el"
:end:

Shell configuration module automatically tangled in =./lisp/setup-shell.el=
#+begin_src emacs-lisp :noweb yes
  ;;; setup-shell.el --- Shell configuration module -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src


** vterm 

Last emacs terminal emulator :  https://github.com/akermu/emacs-libvterm

[[https://github.com/jixiuf/vterm-toggle][vterm-toggle]] toggles between the Vterm buffer and the current editing buffer 

#+begin_src emacs-lisp
  (use-package vterm
    :commands vterm
    :custom
    (vterm-disable-bold-font t)
    (vterm-disable-inverse-video nil)
    (vterm-disable-underline nil)
    (vterm-kill-buffer-on-exit t)
    (vterm-max-scrollback 9999)
    (vterm-shell "/bin/zsh")
    (vterm-term-environment-variable "xterm-256color"))

  (use-package vterm-toggle
    :custom
    ;; Show Vterm Buffer in bottom side
    (vterm-toggle-fullscreen-p nil)
    :init
    (add-to-list 'display-buffer-alist
                 '((lambda(bufname _) (with-current-buffer bufname (equal major-mode 'vterm-mode)))
                   (display-buffer-reuse-window display-buffer-in-side-window)
                   (side . bottom)
                   (dedicated . t) ;dedicated is supported in emacs27
                   (reusable-frames . visible)
                   (window-height . 0.3)))
    :bind
    (:map nc-map
          ("$" . vterm-toggle)
          :map vterm-mode-map
          ("C-<return>" . vterm-toggle-insert-cd)
          ("C-S-n" . vterm-toggle-forward)
          ("C-S-p" . vterm-toggle-backward)
          ))
#+end_src

** aweshell

[[https://github.com/manateelazycat/aweshell][aweshell]] Awesome eshell (eshell extensions)

#+begin_src emacs-lisp
  (use-package aweshell
    :straight (aweshell
               :type git
               :host github
               :repo "manateelazycat/aweshell")
    :custom
    (eshell-highlight-prompt nil)
    (eshell-prompt-function 'epe-theme-dakrone)

    :bind
    (:map nc-map
          ("C-e" . aweshell-dedicated-toggle)))
#+end_src
* Custom Functions
:properties:
:header-args+: :tangle "./lisp/setup-functions.el"
:end:

Custom functions module automatically tangled in =./lisp/setup-functions.el=
#+begin_src emacs-lisp :noweb yes
  ;;; setup-functions.el --- Custom functions module -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src

** Emacs Config File

 #+begin_src emacs-lisp
   (defun nc/goto-emacs-config ()
       "Edit Readme.org"
       (interactive)
       (find-file "~/.emacs.d/Readme.org"))     
 #+end_src

** My personal credentials

#+begin_src emacs-lisp
    (defun nc/goto-my-credentials ()
      "Goto my credentials"
      (interactive)
      ;; before disable super-save-mode
      ;;(super-save-stop)
      (find-file (concat nc/org-default-personal-dir "/password.gpg")))

  (bind-key "gp" 'nc/goto-my-credentials nc-map)
#+end_src


** Pseudo uuid

Generate a 32 random pseudo uuid

#+begin_src emacs-lisp
  (defun nc--random-alnum ()
    (let* ((alnum "abcdef0123456789")
           (i (% (abs (random)) (length alnum))))
      (substring alnum i (1+ i))))

  (defun nc/uuid ()
    "Generate a pseudo UUID"
    (interactive)
    (dotimes (i 32) (insert (nc--random-alnum))))

  (bind-key "iu" 'nc/uuid nc-map)
#+end_src


** Password generator
Generates a strong password

 #+begin_src emacs-lisp
   (defun nc--random-char ()
       (let* ((alnum "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ-/%+*?&#[]()={}_<>!$,;:^µ0123456789")
              (i (% (abs (random)) (length alnum))))
         (substring alnum i (1+ i))))


   (defun nc/generate-password ()
       "Generates a strong password"
       (interactive)
       (dotimes (i 12) (insert (nc--random-char))))

   (bind-key "ip" 'nc/generate-password nc-map)
 #+end_src

** TimeSlot
Insert time slot mainly used when I schedule meeting or appointment.
#+begin_src emacs-lisp
  (defvar current-hour-format "%H:00")

  (defun nc/insert-time-slot ()
    "Insert Time Slot"
    (interactive)
    (let ((begin (format-time-string current-hour-format (current-time)))
          (end (format-time-string current-hour-format (time-add (current-time) (seconds-to-time 3600)))))
      (insert (concat begin "-" end))))

  (bind-key "it" 'nc/insert-time-slot nc-map)

#+end_src

