emacs/.emacs.d/Readme.org
** Inserting time stamps
   From : https://github.com/novoid/dot-emacs/blob/master/config.org#inserting-time-stamps--my-map-ddtt

#+begin_src emacs-lisp
  (defun nc/insert-datestamp()
    "Insert the current date in yyyy-mm-dd format."
    (interactive "*")
    (if (eq major-mode 'org-mode)
        (progn
          (org-insert-time-stamp nil nil nil)
          (insert " "))
        (insert (format-time-string "%Y-%m-%d" (current-time)))))

  (bind-key "id" 'nc/insert-datestamp nc-map)
 #+end_src


 #+begin_src emacs-lisp
   (defun nc/insert-datestamp-inactive()
     "Insert the current date in yyyy-mm-dd format."
     (interactive "*")
     (if (eq major-mode 'org-mode)
         (progn
       (org-insert-time-stamp nil nil t)
       (insert " "))
       (insert (format-time-string "%Y-%m-%d" (current-time)))))

   (bind-key "iD" 'nc/insert-datestamp-inactive nc-map)
 #+end_src

** Searching in my notes

#+begin_src emacs-lisp
  (defun nc/search-notes ()
    "Search in all my org notes"
    (interactive)
    (consult-ripgrep org-directory ""))

  (bind-key "sn" 'nc/search-notes nc-map)
#+end_src

** Sudo Edit File

From : https://karthinks.com/software/fifteen-ways-to-use-embark/

#+begin_src emacs-lisp
      (defun nc/sudo-find-file (file)
        "Open FILE as root."
        (interactive "FOpen file as root: ")
        (when (file-writable-p file)
          (user-error "File is user writeable, aborting sudo"))
        (find-file (if (file-remote-p file)
                       (concat "/" (file-remote-p file 'method) ":"
                               (file-remote-p file 'user) "@" (file-remote-p file 'host)
                               "|sudo:root@"
                               (file-remote-p file 'host) ":" (file-remote-p file 'localname))
                     (concat "/sudo:root@localhost:" file))))
#+end_src
* Provided modules

** =setup-prefs= module
#+begin_src emacs-lisp :tangle ./lisp/setup-prefs.el
  (provide 'setup-prefs)
  ;;; setup-prefs.el ends here
#+end_src


** =setup-ui= module
#+begin_src emacs-lisp :tangle ./lisp/setup-ui.el
  (provide 'setup-ui)
  ;;; setup-ui.el ends here
#+end_src


** =setup-keys= module
#+begin_src emacs-lisp :tangle ./lisp/setup-keys.el
  (provide 'setup-keys)
  ;;; setup-keys.el ends here
#+end_src

** =setup-windows= module
#+begin_src emacs-lisp :tangle ./lisp/setup-windows.el
  (provide 'setup-windows)
  ;;; setup-windows.el ends here
#+end_src



** =setup-core= module
#+begin_src emacs-lisp :tangle ./lisp/setup-core.el
  (provide 'setup-core)
  ;;; setup-core.el ends here
#+end_src
** =setup-completion= module
#+begin_src emacs-lisp :tangle ./lisp/setup-completion.el
  (provide 'setup-completion)
  ;;; setup-completion.el ends here
#+end_src


** =setup-org= module
#+begin_src emacs-lisp :tangle ./lisp/setup-org.el
  (provide 'setup-org)
  ;;; setup-org.el ends here
#+end_src

** =nc-programming= module
#+begin_src emacs-lisp :tangle ./lisp/setup-programming.el
  (provide 'setup-programming)
  ;;; setup-programming.el ends here
#+end_src


** =setup-shell= module
#+begin_src emacs-lisp :tangle ./lisp/setup-shell.el
  (provide 'setup-shell)
  ;;; setup-shell.el ends here
#+end_src

** =setup-functions= module
#+begin_src emacs-lisp :tangle ./lisp/setup-functions.el
  (provide 'setup-functions)
  ;;; setup-functions.el ends here
#+end_src


# Local Variables:
# eval: (add-hook 'after-save-hook #'org-babel-tangle nil t)
# End:
