emacs/.emacs.d/lisp/setup-completion.el
;;; setup-completion.el ends here
