emacs/.emacs.d/lisp/setup-prefs.el

(provide 'setup-prefs)
;;; setup-prefs.el ends here
