emacs/.emacs.d/lisp/setup-shell.el

(provide 'setup-shell)
;;; setup-shell.el ends here
